# CountFillSpaces

## Description
Returns the number of fill spaces currently attached to a specified object.

```pascal
FUNCTION CountFillSpaces(h : HANDLE): INTEGER;
```

```python
def vs.CountFillSpaces(h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to the object containing the fill spaces to be counted.|

## Version
Availability: from Vectorworks 2018

## Category
* Object Attributes